Repository: PureBasicCN/PureBasicPreference
Catalog: OmegaT/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "Find Next" will still only search, but with each click on the "Replace" button, the next match of the search word will be replaced by whatever is inside the "Replace with" box.
zh_cn: “查找下一个”将仍然只搜索，但点击“替换”按钮时，会在下一次搜索内容时会将匹配的内容用“替换为”文本行的内容替换掉。

source: "Hello World" in a MessageRequester():
zh_cn: 在 对话框窗口输出 "Hello World" :

source: "Hello World" in the Debug output window:
zh_cn: 在 Debug 窗口输出 "Hello World" :

source: %dd: Will be replaced by the day value, on 2 digits.
zh_cn: %dd: 将替换为 日，2位数字.

source: %hh: Will be replaced by the hour value, on 2 digits.
zh_cn: %hh: 将替换为 小时，2位数字.

source: %ii: Will be replaced by the minute value, on 2 digits.
zh_cn: %ii: 将替换为 分钟，2位数字.

source: %mm: Will be replaced by the month value, on 2 digits.
zh_cn: %mm: 将替换为 月，2位数字.

source: %ss: Will be replaced by the second value, on 2 digits.
zh_cn: %ss: 将替换为 秒，2位数字.

source: %yy: Will be replaced by the year value, on 2 digits.
zh_cn: %yy: 将替换为 年，2位数字.

source: %yyyy: Will be replaced by the year value, on 4 digits.
zh_cn: %yyyy: 将替换为 年，4位数字.

source: (*.* or an empty extension field searches all files).
zh_cn: (使用 *.* 或不填内容会对所有文件进行搜索 )

source: (This is only possible if the included file is written as a literal string, and not through for example a constant.)
zh_cn: （仅当引用的文件是文本字串而不是常数时）。

source: - 486, Pentium (Pro, II, III) support
zh_cn: - 支持 486, Pentium (Pro, II, III)

source: - 486, Pentium, Core2, Core i7, Athlon, Phenom support
zh_cn: - 支持486，奔腾，酷睿，酷睿i7，速龙，羿(Phenom)

source: - First steps
zh_cn: - 第一步

source: - String Manipulation
zh_cn: - 字符串操作

source: - Storing data in memory
zh_cn: - 存储在内存中的数据

source: - Input & Output
zh_cn: - 输入与输出

source: - Displaying text output (Console)
zh_cn: - 文本输出（控制台）

source: - Building a graphical user interface (GUI)
zh_cn: - 建立图形用户界面（GUI）

source: - Displaying graphics output & simple drawing
zh_cn: - 图形输出和简单绘图

source: - Structuring code in Procedures
zh_cn: - 结构化程序代码

source: - Compiler directives (for different behavior on different OS)
zh_cn: - 编译器指令（在不同的操作系统中指令会有所不同）

source: - Reading and writing files
zh_cn: - 读取和写入文件

source: - Memory access
zh_cn: - 内存访问

source: - Variables and Processing of variables
zh_cn: - 变量和变量处理

source: - Dynamic numbering using #PB_Any
zh_cn: - 使用#PB_Any动态编号

source: - Managing multiple windows with different content
zh_cn: - 多窗口管理

source: - Other Compiler keywords
zh_cn: - 其他关键字

source: - Other Library functions
zh_cn: - 其他库函数

source: - Advanced functions
zh_cn: - 高级功能

source: - Some Tips & Tricks
zh_cn: - 一些提示和技巧

source: - Constants
zh_cn: - 常量

source: - Decisions & Conditions
zh_cn: - 判断与条件

source: - Loops
zh_cn: - 循环

source: - All Standard BASIC keywords: If-Else-EndIf, Repeat-Until, etc.
zh_cn: - 所有标准 BASIC 关键词: If-Else-EndIf, Repeat-Until, 等等....

source: - Built-in arrays, dynamically linked lists, complex structures, pointers and variable definitions
zh_cn: - 内置数组，动态链表，复杂结构，指针和变量自定义

source: - Built-in arrays, linked lists, maps, complex structures, pointers and variable definitions
zh_cn: - 内置数组，链表，映射，复杂的结构，指针变量定义

source: - Built-in string types (characters) and transparent unicode support
zh_cn: - 内置字符串类型（字符）和透明的Unicode支持

source: - Built-in string types (characters)
zh_cn: - 内置字符串类型 (字符)

source: - Configurable CLI compiler
zh_cn: - 可配置的 CLI 编译器

source: - Constants, binary and hexadecimal numbers supported
zh_cn: - 常量，二进制和十六进制数的支持

source: - Expression reducer and optimizer (grouping constants and explicit numbers together)
zh_cn: - 表达式reducer和优化（分组常量和显示的数字加在一起）

source: - Inline assembler
zh_cn: - 行内嵌汇编

source: - Intel (x86 and x64) support
zh_cn: - 支持Intel (x86 and x64)

source: - Powerful native IDE and debuggers
zh_cn: - 强大的原生 IDE 和调试器

source: - Standard arithmetic support in respect of sign priority and parenthesis: +, -, /, *, and, or, lsl, asl, lsr, asr
zh_cn: - 关于优先标志和括号的标准算法的支持： - ，/，*，与，或，LSL，ASL，LSR，ASR ，

source: - Supported types: Byte (8 bit), Word (16 bit), Long (32 bit), Float (32 bit), Quad (64 bit), Double (64 bit) and also user defined types (structures)
zh_cn: - 支持类型: Byte (8 bit), Word (16 bit), Long (32 bit), Float (32 bit), Quad (64 bit), Double (64 bit) 并且也支持用户自定义类型 (结构)

source: - Supported types: Byte (8-bit), Word (16-bit), Long (32-bit), Float (32-bit), Quad (64-bit), Double (64-bit) and user defined types (structures)
zh_cn: - 支持类型有: Byte (8-bit), Word (16-bit), Long (32-bit), Float (32-bit), Quad (64-bit), Double (64-bit) 和用户自定义类型 (结构)

source: - System friendly, easy to install and use
zh_cn: - 友好的系统,安装和使用都很简单

source: - Very fast compilation
zh_cn: - 非常快速的编译

source: - Windows XP, Windows Vista, Windows 7, Windows 8 or Windows 10
zh_cn: - Windows XP, Windows Vista, Windows 7, Windows 8 or Windows 10- Windows XP, Windows Vista, Windows 7, Windows 8 or Windows 10

source: /A <tools file> loads/saves the configuration of the external tool from/to this file
zh_cn: /A <tools file> 从指定的文件加载或者保存外部工具配置

source: /BUILD <file> specifies the project file to build
zh_cn: /BUILD <file> 指定要生成的项目文件

source: /E <Explorer path> starts the Explorer tool with the given path
zh_cn: /E <Explorer path> 指定资源管理器起始路径

source: /H <HistoryDatabase> specify the file to use for the session history database
zh_cn: /H <HistoryDatabase> 指定会话历史数据库文件

source: /L <Line number> moves the cursor to the given line number in the last opened file
zh_cn: /L <Line number> 将光标移动到上次打开的文件的指行

source: /LOCAL puts all preferences in the PureBasic directory instead of the user profile location
zh_cn: /LOCAL 使用 PureBasic 目录代替用户路径来存放所有配置信息

source: /NOEXT disables the registering of the .pb extension in the registry
zh_cn: /NOEXT 禁用注册表中的 .pb的扩展名

source: /P <Preferences file> loads/saves all the configuration to/from the given file
zh_cn: /P <Preferences file> 从指定的文件加载/保存所有配置。

source: /PORTABLE the same as /LOCAL and /NOEXT combined
zh_cn: /PORTABLE 同于 /LOCAL 和 /NOEXT 的结合。

source: /QUIET hides all build messages except errors
zh_cn: /QUIET 隐藏所有生成信息但错误除外

source: /READONLY does not update the project file after compiling (with new access time and build counters)
zh_cn: /READONLY 编译后不更新新项目文件(新的访问时间和生成计数)

source: /S <Source path> overwrites the "Source path" setting from the preferences
zh_cn: /S <Source path> 重写“配置”里的"源路径" 设置

source: /T <Templates file> loads/saves the code templates from/to the given file
zh_cn: /T <Templates file> 从指定的文件加载或者保存代码模板

source: /TARGET <target> specifies the target to build (the default is to build all targets)
zh_cn: /TARGET <target> 指定生成目标 (默认是生成全部目标)

source: /VERSION displays the IDE version and exits
zh_cn: /VERSION 显示IDE 版本并退出

source: 0 : Sunday
zh_cn: 0 : Sunday【星期日】

source: 1 - Blue
zh_cn: 1 - 蓝色

source: 1 : Monday
zh_cn: 1 : Monday【星期一】

source: 1 : Underline cursor (default)
zh_cn: 1 : Underline 下划线光标 (默认)

source: 1 company site license (unlimited license for one company site)
zh_cn: 一个公司站点许可证（为一家公司的网站无限许可）

source: 1 educational license (for one room class, including teacher)
zh_cn: 一个教育许可 (一个教室，包括老师)

source: 1 single user license
zh_cn: 一个单用户许可

source: 10: Full-height cursor
zh_cn: 10: Full-height 完整高度光标

source: 14 - Yellow
zh_cn: 14 - 黄色

source: 15 - White
zh_cn: 15 - 白色

source: 2 - Green
zh_cn: 2 - 绿色

source: 2 : Tuesday
zh_cn: 2 : Tuesday【星期二】

source: 20 such past cursor positions are remembered.
zh_cn: 最多保存20个历史指针位置信息。

source: 2D Games & Multimedia Libraries
zh_cn: 2D 游戏 & 多媒体库

source: 3 : Wednesday
zh_cn: 3 : Wednesday【星期三】

source: 3D Games & Multimedia Libraries
zh_cn: 3D 游戏 与多媒体库

source: 4 - Red
zh_cn: 4 - 红色

source: 4 : Thursday
zh_cn: 4 : Thursday【星期四】

source: 5 : Friday
zh_cn: 5 : Friday【星期五】

source: 5 : Mid-height cursor
zh_cn: 5 : Mid-height 中高光标

source: 6 : Saturday
zh_cn: 6 : Saturday【星期六】

source: <- Alpha() - 2DDrawing Index - BackColor() ->
zh_cn: <- Alpha() - 2DDrawing 目录 - BackColor() ->

source: <- AlphaBlend() - 2DDrawing Index - Blue() ->
zh_cn: <- AlphaBlend() - 2DDrawing 目录 - Blue() ->

source: <- AmbientColor() - Engine3D Index - CheckObjectVisibility() ->
zh_cn: <- AmbientColor() - Engine3D 索引 - CheckObjectVisibility() ->

source: <- BackColor() - 2DDrawing Index - Box() ->
zh_cn: <- BackColor() - 2DDrawing 索引 - Box() ->

source: <- Blue() - 2DDrawing Index - BoxedGradient() ->
zh_cn: <- Blue() - 2DDrawing 索引 - BoxedGradient() ->

source: <- Box() - 2DDrawing Index - Circle() ->
zh_cn: <- Box() - 2DDrawing 索引 - Circle() ->

source: <- BoxedGradient() - 2DDrawing Index - CircularGradient() ->
zh_cn: <- BoxedGradient() - 2DDrawing 索引 - CircularGradient() ->

source: <- Circle() - 2DDrawing Index - ClipOutput() ->
zh_cn: <- Circle() - 2DDrawing索引 - ClipOutput() ->

source: <- CircularGradient() - 2DDrawing Index - ConicalGradient() ->
zh_cn: <- CircularGradient() - 2DDrawing 索引 - ConicalGradient() ->

source: <- ClearConsole() - Console Index - ConsoleColor() ->
zh_cn: <- ClearConsole() - Console 目录 - ConsoleColor() ->

source: <- ClipOutput() - 2DDrawing Index - CustomFilterCallback() ->
zh_cn: <- ClipOutput() - 2DDrawing 索引 - CustomFilterCallback() ->

source: <- CloseConsole() - Console Index - ConsoleCursor() ->
zh_cn: <- CloseConsole() - Console 索引 - ConsoleCursor() ->

source: <- ConicalGradient() - 2DDrawing Index - CustomGradient() ->
zh_cn: <- ConicalGradient() - 2DDrawing 索引 - CustomGradient() ->

source: <- ConsoleColor() - Console Index - ConsoleError() ->
zh_cn: <- ConsoleColor() - Console 目录 - ConsoleError() ->

source: <- ConsoleCursor() - Console Index - ConsoleLocate() ->
zh_cn: <- ConsoleCursor() - Console 索引 - ConsoleLocate() ->

source: <- ConsoleError() - Console Index - ConsoleTitle() ->
zh_cn: <- ConsoleError() - Console 索引 - ConsoleTitle() ->

source: <- ConsoleLocate() - Console Index - EnableGraphicalConsole() ->
zh_cn: <- ConsoleLocate() - Console 目录 - EnableGraphicalConsole() ->

source: <- CustomFilterCallback() - 2DDrawing Index - DrawAlphaImage() ->
zh_cn: <- CustomFilterCallback() - 2DDrawing 索引 - DrawAlphaImage() ->

source: <- CustomGradient() - 2DDrawing Index - DrawImage() ->
zh_cn: <- CustomGradient() - 2DDrawing 索引 - DrawImage() ->

source: <- DatabaseError() - Database Index - DatabaseQuery() ->
zh_cn: <- DatabaseError() - Database 索引 - DatabaseQuery() ->

source: <- DrawAlphaImage() - 2DDrawing Index - DrawRotatedText() ->
zh_cn: <- DrawAlphaImage() - 2DDrawing 目录 - DrawRotatedText() ->

source: <- DrawText() - 2DDrawing Index - DrawingBufferPitch() ->
zh_cn: <- DrawText() - 2DDrawing 目录 - DrawingBufferPitch() ->

source: <- DrawingBuffer() - 2DDrawing Index - DrawingBufferPixelFormat() ->
zh_cn: <- DrawingBuffer() - 2DDrawing 目录 - DrawingBufferPixelFormat() ->

source: <- DrawingBufferPitch() - 2DDrawing Index - DrawingFont() ->
zh_cn: <- DrawingBufferPitch() - 2DDrawing 目录 - DrawingFont() ->

source: <- DrawingBufferPixelFormat() - 2DDrawing Index - DrawingMode() ->
zh_cn: <- DrawingBufferPixelFormat() - 2DDrawing 目录 - DrawingMode() ->

source: <- DrawingFont() - 2DDrawing Index - Ellipse() ->
zh_cn: <- DrawingFont() - 2DDrawing 目录 - Ellipse() ->

source: <- EnableManualEntityBoneControl() - Entity Index - EntityBonePitch() ->
zh_cn: <- EnableManualEntityBoneControl() - Entity 索引 - EntityBonePitch() ->

source: <- Input() - Console Index - Print() ->
zh_cn: <- Input() - Console 索引 - Print() ->

source: <- WindowOutput() - Window Index - WindowWidth() ->
zh_cn: <- WindowOutput() - Window 索引 - WindowWidth() ->

source: <- WindowVectorOutput() - Window Index - WindowX() ->
zh_cn: <- WindowVectorOutput() - Window 索引 - WindowX() ->

source: <- WindowWidth() - Window Index - WindowY() ->
zh_cn: <- WindowWidth() - Window 索引 - WindowY() ->

source: #PB_Any can be used to auto-generate this number.
zh_cn: #PB_Any 可以用来自动生成这个编码.

source: 2DDrawing Index - AlphaBlend() ->
zh_cn: 2DDrawing 目录 - AlphaBlend() ->

source: PureBasic 5.42 LTS (all OS) (03/01/2016)
zh_cn: PureBasic 5.42 LTS (全部 OS) (03/01/2016)

source: AddDate
zh_cn: AddDate 用途：给日期加一个时间

source: Alpha
zh_cn: 取得Alpha颜色分量Alpha

source: AvailableSerialPortInput
zh_cn: AvailableSerialPortInput 用途：返回串口输入缓冲区中的剩余字节数

source: Commands Index
zh_cn: 命令索引

source: Console Index - CloseConsole() ->
zh_cn: Console 索引 - CloseConsole() ->

source: Define
zh_cn: 定义

source: Deutsch
zh_cn: 英语

source: DrawingBuffer() must be called before using this function.
zh_cn: DrawingBuffer()必须在使用此函数之前调用。

source: Francais
zh_cn: 法语

source: Getting started
zh_cn: 入门

source: Joystick
zh_cn: 操纵杆

source: Overview | Next: Variables >
zh_cn: 概述 | 下一篇： 变量 >

source: PureBasic objects overview
zh_cn: PureBasic对象概述

source: Reference manual | Next: First steps >
zh_cn: 手册首页l | 下一篇： 第一步 >

source: 'Include' Functions
zh_cn: 'Include' 功能

source: BoxedGradient
zh_cn: 矩形梯度BoxedGradient

source: Clipboard
zh_cn: 剪贴板

source: FormatDate
zh_cn: FormatDate 用途：指定日期/时间的输出格式

source: OpenSerialPort
zh_cn: OpenSerialPort 用途：打开一个串口

source: PureBasic 5.41 LTS (all OS) (12/23/2015)
zh_cn: PureBasic 5.41 LTS (全部 OS) (12/23/2015)

source: Circle
zh_cn: 绘制圆Circle

source: Compiler Directives
zh_cn: 编译器指令

source: Console
zh_cn: 控制台

source: Hour
zh_cn: Hour 用途：获取指定日期中小时数<小时>

source: ReadSerialPortData
zh_cn: ReadSerialPortData 用途：读取串口数据

source: Sound
zh_cn: 音频

source: CircularGradient
zh_cn: 锥形梯度CircularGradient

source: Compiler Functions
zh_cn: 编译器功能

source: Database
zh_cn: 数据库

source: Minute
zh_cn: Minute 用途：获取指定日期中分钟数<分钟>

source: SerialPortError
zh_cn: SerialPortError 用途：返回使用 ReadSerialPortData(), WriteSerialPortData() 或者 WriteSerialPortString() 失败时串口产生的错误

source: SoundPlugin
zh_cn: 音频插件

source: ClipOutput
zh_cn: 设置绘图区域ClipOutput

source: Date
zh_cn: 日期

source: Month
zh_cn: Month 用途：获取指定日期中的月份<月份>

source: SerialPortID
zh_cn: SerialPortID 用途：返回串口的唯一系统标识符

source: Building a DLL
zh_cn: 构建一个DLL

source: Debugger
zh_cn: 调试器

source: ParseDate
zh_cn: ParseDate 用途：将日期从字符串型转换为日期型

source: SerialPortTimeouts
zh_cn: SerialPortTimeouts 用途：更改默认设定的串口超时时间

source: CustomFilterCallback
zh_cn: 自定义筛选回调CustomFilterCallback

source: Desktop
zh_cn: 桌面

source: Second
zh_cn: Second 用途：获取指定日期中的秒数<秒>

source: SetSerialPortStatus
zh_cn: SetSerialPortStatus 用途：更改指定的串口状态

source: PureBasic 5.40 LTS (all OS) (10/16/2015)
zh_cn: PureBasic 5.40 LTS (全部 OS) (10/16/2015)

source: CustomGradient
zh_cn: 自定义梯度CustomGradient

source: Dialog
zh_cn: 对话框

source: WriteSerialPortData
zh_cn: WriteSerialPortData 用途：将任意数量的数据写入指定的串口

source: Year
zh_cn: Year 用途：获取指定日期是哪一年<年份>

source: DrawAlphaImage
zh_cn: 绘制α图DrawAlphaImage

source: WriteSerialPortString
zh_cn: WriteSerialPortString 用途：将一个字符串写入指定的串口

source: DrawImage
zh_cn: 绘制图像DrawImage

source: File
zh_cn: 文件

source: Several PureBasic versions at once
zh_cn: 同时多版本PureBasic

source: DrawRotatedText
zh_cn: 绘制旋转文本DrawRotatedText

source: FileSystem
zh_cn: 文件系统

source: Migrating from an old version of PureBasic
zh_cn: 从旧版本的PureBasic的迁移

source: AlphaBlend
zh_cn: Alpha混合颜色AlphaBlend

source: Array
zh_cn: 数组

source: AvailableSerialPortOutput
zh_cn: AvailableSerialPortOutput 用途：返回串口输出缓冲区中的剩余字节数

source: General Syntax Rules
zh_cn: 常规语法规则

source: Handles and Numbers
zh_cn: 句柄和数字

source: Keyboard
zh_cn: 键盘

source: PureBasic Constants
zh_cn: PureBasic 常量

source: Working with files
zh_cn: 文件处理

source: DrawText
zh_cn: 绘制文本DrawText

source: DrawingBuffer
zh_cn: 绘图缓冲区DrawingBuffer

source: Font
zh_cn: 字体

source: PureBasic 5.24 LTS (all OS) (10/30/2014)
zh_cn: PureBasic 5.24 LTS (全部OS) (10/30/2014)

source: DrawingBufferPitch
zh_cn: 绘图缓冲区间距DrawingBufferPitch

source: Gadget
zh_cn: 控件

source: DrawingBufferPixelFormat
zh_cn: 图形缓冲区像素格式DrawingBufferPixelFormat

source: Help
zh_cn: 帮助

source: DrawingFont
zh_cn: 绘图字体DrawingFont

source: DrawingMode
zh_cn: 绘图模式DrawingMode

source: Ellipse
zh_cn: 椭圆Ellipse

source: EllipticalGradient
zh_cn: 椭圆梯度EllipticalGradient

source: FillArea
zh_cn: 填充区域FillArea

source: FrontColor
zh_cn: 字体颜色FrontColor

source: BackColor
zh_cn: 设置背景色BackColor

source: CloseSerialPort
zh_cn: CloseSerialPort 用途：关闭先前使用OpenSerialPort()打开的串口

source: Day
zh_cn: Day 用途：获取指定日期中的<日>

source: Editing features
zh_cn: 编辑功能

source: Mouse
zh_cn: 鼠标

source: Platform-dependant Functions
zh_cn: 依赖于平台的功能

source: Pointers and Memory access
zh_cn: 指针和内存访问

source: Variables, Types and Operators
zh_cn: 变量，类型和运算符

source: GetOriginX
zh_cn: 原点XGetOriginX

source: GetOriginY
zh_cn: 原点YGetOriginY

source: GrabDrawingImage
zh_cn: 抓取图形图像GrabDrawingImage

source: GradientColor
zh_cn: 渐变颜色GradientColor

source: SQLite SQL functions
zh_cn: SQLite SQL 函数

source: Blue
zh_cn: 取得蓝色分量值Blue

source: Data
zh_cn: 数据

source: DayOfWeek
zh_cn: DayOfWeek 用途：获取指定日期这一天是<星期几>

source: GetSerialPortStatus
zh_cn: GetSerialPortStatus 用途：返回指定的串口状态

source: Music
zh_cn: 音乐

source: Regular Expression
zh_cn: 正则表达式

source: PostgreSQL manual
zh_cn: PostgreSQL 手册

source: Serial Port
zh_cn: 串口

source: SetOrigin
zh_cn: 设置原点SetOrigin

source: StartDrawing
zh_cn: 开始绘图StartDrawing

source: Box
zh_cn: 绘制矩形Box

source: Cipher
zh_cn: 加密

source: DayOfYear
zh_cn: DayOfYear 用途：返回指定日期从01月01日起到指定日期之间已过的天数

source: Debugger Commands
zh_cn: 调试器命令

source: IsSerialPort
zh_cn: IsSerialPort 用途：判断给定的串口是否有效和正确初始化

source: Screen
zh_cn: 屏幕

source: StopDrawing
zh_cn: 停止绘图StopDrawing

source: TextHeight
zh_cn: 文本高度TextHeight

source: TextWidth
zh_cn: 文本宽度TextWidth

source: UnclipOutput
zh_cn: 取消绘图区限制UnclipOutput

source: support@purebasic.com
zh_cn: 100860505@qq.com

source: Debug Date() / (3600*24*365) ; will print the number of years since 01/01/1970 and now
zh_cn: Debug Date() / (3600*24*365) ; 将输出从1970年01月01日至今的年数

source: Debug DayOfWeek(Date(2006, 10, 30, 0, 0, 0)) ; Outputs '1' for Monday.
zh_cn: Debug DayOfWeek(Date(2006, 10, 30, 0, 0, 0)) ; 输出 '1' 表示 星期一.

source: Debug FormatDate("Y=%yyyy, M= %mm, D=%dd", Date()) ; Will display the actual date with
zh_cn: Debug FormatDate("Y=%yyyy, M= %mm, D=%dd", Date()) ; 将显示当前系统日期

source: Debug Hour(Date(1970, 1, 1, 11, 3, 45)) ; Outputs '11'.
zh_cn: Debug Hour(Date(1970, 1, 1, 11, 3, 45)) ; 输出 '11' 点.

source: Debug Minute(Date(1970, 1, 1, 11, 3, 45)) ; Outputs '3'.
zh_cn: Debug Minute(Date(1970, 1, 1, 11, 3, 45)) ; 输出 '3' 分钟.

source: Debug Month(Date(2002, 10, 3, 0, 0, 0)) ; Outputs '10'.
zh_cn: Debug Month(Date(2002, 10, 3, 0, 0, 0)) ; 输出 '10' 月份.

source: Debug ParseDate("%yy/%mm/%dd", "10/01/07") ; Returns the date value of "10/01/07"
zh_cn: Debug ParseDate("%yy/%mm/%dd", "10/01/07") ; 返回日期格式 "10/01/07"

source: Debug Second(Date(1970, 1, 1, 11, 3, 45)) ; Outputs '45'.
zh_cn: Debug Second(Date(1970, 1, 1, 11, 3, 45)) ; 输出 '45' 秒.

source: Debug Year(Date(2002, 10, 3, 0, 0, 0)) ; Outputs '2002'.
zh_cn: Debug Year(Date(2002, 10, 3, 0, 0, 0)) ; 输出 '2002' 年.

source: Declare can help in this particular case by declaring only the header of the procedure.
zh_cn: Declare 可以在这种特定情况下仅在头中声明过程.

source: Global provides the ability for variables to be defined as global, i.e., variables defined as such may then be accessed within a Procedure.
zh_cn: Global 提供将变量定义为全局的能力,定义的变量随后可以在 Procedure内部使用.

source: A is an integer - but note that you can't declare variables this way if you use the EnableExplicit directive.
zh_cn: A是一个整型（integer） - 但请注意，如果你用EnableExplicit指示，就不能这样声明变量。

source: Compile/Run
zh_cn: 编译/运行

source: Example: With default type
zh_cn: 示例︰默认类型

source: Example: With variables
zh_cn: 示例︰变量

source: Main source file
zh_cn: 主源文件

source: Menu Skip to content
zh_cn: 菜单跳至内容

source: New
zh_cn: 新建

source: PureBasic Chat
zh_cn: PureBasic 聊天

source: PureBasic Forums
zh_cn: PureBasic 论坛

source: PureBasic Resources
zh_cn: PureBasic 资源

source: PureBasic is a low cost programming language.
zh_cn: PureBasic 是一个便宜的编程语言.

source: Recent Files
zh_cn: 最近使用文件

source: Registered users area
zh_cn: 注册会员请注意:中文网站不提供任何形式的PureBasic的销售途径,这里的连接全部跳转至官网,请中文用户前往官方站点下载，谢谢!

source: Some applications and games written in PureBasic:
zh_cn: 一些使用PureBasic编写的应用程序和游戏:

source: The IDE (fully written in PureBasic) on Windows, Linux and MacOS X:
zh_cn: IDE (完全使用PureBasic) 支持Windows, Linux 和 MacOS X:

source: The code editing area (below the toolbar)
zh_cn: 代码编辑区域 (在工具栏下面)

source: Undo
zh_cn: 撤消

source: Technical Features
zh_cn: 技术特点

source: Save
zh_cn: 保存

source: Debug FormatDate("%hh:%ii:%ss", Date()) ; Will display the time using the 00:00:00 format
zh_cn: Debug FormatDate("%hh:%ii:%ss", Date()) ; 将以 15:20:02 时间格式显示

source: Copy
zh_cn: 复制

source: Compile with Debugger
zh_cn: 调试编译

source: Use Icon (Windows and MacOS X only)
zh_cn: 使用图标 (仅限 Windows 和 MacOS X 系统)

source: Save As...
zh_cn: 另存为...

source: Paste
zh_cn: 粘贴

source: Compile without Debugger
zh_cn: 不启用调试编译

source: Variable Viewer
zh_cn: 变量查看器

source: Save All
zh_cn: 保存全部

source: Find Next
zh_cn: 查找下一个

source: Insert comments
zh_cn: 插入注释

source: Restart Compiler (not present on all OS)
zh_cn: 重新启动编译器 （不适用于所有系统）

source: Help Tool
zh_cn: 帮助工具

source: Reload
zh_cn: 重新加载

source: Find in Files
zh_cn: 在文件中查找

source: Remove comments
zh_cn: 移除注释

source: Specific features depending on the OS
zh_cn: 针对操作系统的差异化特性

source: Compiler Options
zh_cn: 编译器选项

source: Close
zh_cn: 关闭

source: Format indentation
zh_cn: 自动缩进

source: Create executable
zh_cn: 生成可执行文件

source: Debug d ; will output 4
zh_cn: Debug d ; 将输出 4

source: Run only one Instance
zh_cn: 只允许一个实例

source: Close All
zh_cn: 关闭全部

source: Requirements
zh_cn: 系统必备

source: Set default Target
zh_cn: 设置默认目标

source: Select all Selects the whole source code.
zh_cn: 全选 选中所有代码。

source: View changes
zh_cn: 查看更改

source: Build Target
zh_cn: 创建目标

source: Goto
zh_cn: 跳转...

source: Product information
zh_cn: 产品信息

source: File format
zh_cn: 文件格式

source: Build all Targets
zh_cn: 创建所有目标

source: Do you want to know what users think about PureBasic ?
zh_cn: 你想知道用户如何评价 PureBasic？

source: Goto matching Keyword
zh_cn: 跳转到匹配的关键字

source: Preferences
zh_cn: 配置

source: Goto recent line
zh_cn: 返回历史行

source: Session history
zh_cn: 会话历史

source: Debug Date(1999, 12, 31, 23, 59, 59) ; will print '946684799' (number of seconds between 01/01/1970 0:00:00 and 12/31/1999 23:59:59)
zh_cn: Debug Date(1999, 12, 31, 23, 59, 59) ; 将输出 '946684799' ( 从 01/01/1970 0:00:00 到 12/31/1999 23:59:59 的秒数)

source: Debug ParseDate("%mm/%dd/%yyyy", "01/07/2010") ; Returns the date value of "01/07/2010"
zh_cn: Debug ParseDate("%mm/%dd/%yyyy", "01/07/2010") ; 返回日期格式 "01/07/2010"

source: If OpenConsole() PrintN("This is console #"+Str(i)) PrintN("Press return to close console") Input() CloseConsole()
zh_cn: If OpenConsole() PrintN("这是一个控制台 #"+Str(i)) PrintN("按回车键关闭控制台") Input() CloseConsole()

source: Open
zh_cn: 打开

source: Quit
zh_cn: 退出

source: Redo
zh_cn: 重做

source: The tools panel (on the right side by default)
zh_cn: 工具面板 （默认情况下在右侧）

source: Toggle current fold
zh_cn: 切换当前折叠

source: Toggle all Folds
zh_cn: 切换所有折叠

source: Debug "Success"
zh_cn: Debug "成功"

source: Add/Remove Marker
zh_cn: 添加/移除书签

source: Jump to Marker
zh_cn: 跳转到书签

source: Debug FormatDate("%mm/%dd/%yyyy", Date()) ; Will display the actual date with
zh_cn: Debug FormatDate("%mm/%dd/%yyyy", Date()) ; 将显示当前系统日期

source: Automatically hide the Panel
zh_cn: 自动隐藏面板

source: Disable Splash screen
zh_cn: 禁止欢迎界面

source: The main features of PureBasic
zh_cn: PureBasic 主要特点

source: Clear Markers This removes all markers from the current source code.
zh_cn: 清除所有书签 这将从当前的源代码将所有书签标记清除掉。

source: Find/Replace
zh_cn: 查找/替换

source: Use Compiler
zh_cn: 使用编译器

source: Cut
zh_cn: 剪切

source: Debug "Failed"
zh_cn: Debug "失败"

source: Global may also be used with arrays, lists and maps.
zh_cn: Global 也可以用于 数组, 列表 和 映射.

source: Run
zh_cn: 运行EXE

source: The error log (located below the editing area)
zh_cn: 错误日志 （位于编辑区域的下方）

source: #PB_AntialiasingMode_None: No antialiasing (default).
zh_cn: #PB_AntialiasingMode_None: 反锯齿 (默认).

source: #PB_Ascii : the string will be written in ascii format (default, even in unicode mode).
zh_cn: #PB_Ascii : 字符串将以 ascii 的格式写入， (默认, even in unicode mode).
